app/views/comments/index.html.erb

  <%
  @post = Post.find(comment.post_id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]