app/views/home/index.html.erb

SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
            <br>
            <%=Post.last.title%>

SELECT  "thoughts".* FROM "thoughts" ORDER BY "thoughts"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
          <%
          t = Thought.order("RANDOM()").last