app/views/posts/index.html.erb

    <div class="post_controls">
      <%= link_to 'Comments', post %> (<%=post.comments.count%>)
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]