app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("author", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "annoying bot"], ["body", "f word"], ["post_id", 2], ["created_at", 2017-01-26 23:26:45 UTC], ["updated_at", 2017-01-26 23:26:45 UTC]]
---
  def create

      @post = Post.find(params[:post_id])

      respond_to do |format|
        if @post.comments.create(params.require(:comment).permit(:author, :body))

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 6], ["id", 7], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 7]]
---
    def destroy
      @post = Post.find(params[:post_id])
      @comment = @post.comments.find(params[:id])
      @comment.destroy