app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "New Begining"], ["body", "Lets hope that this gets better with more coding underway"], ["created_at", 2017-01-25 03:41:21 UTC], ["updated_at", 2017-01-25 03:41:21 UTC]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "updated_at" = ? WHERE "posts"."id" = ?  [["updated_at", 2017-02-01 02:39:32 UTC], ["id", 2]]