app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags"
---
  def index
    @tags = ActsAsTaggableOn::Tag.all

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @tag =  ActsAsTaggableOn::Tag.find(params[:id])